results/redis/run_workload_b.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P workloads/workloadb -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p operationcount=100000 -p threadcount=10
Command line: -t -db site.ycsb.db.RedisClient -s -P workloads/workloadb -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p operationcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-04-02 12:33:03:791 0 sec: 0 operations; est completion in 0 second 
2026-04-02 12:33:08:253 4 sec: 100000 operations; 22128.79 current ops/sec; [READ: Count=94974, Max=20511, Min=88, Avg=489.91, 90=639, 99=1031, 99.9=3963, 99.99=16079] [CLEANUP: Count=10, Max=760, Min=50, Avg=139.4, 90=130, 99=760, 99.9=760, 99.99=760] [UPDATE: Count=5026, Max=7107, Min=153, Avg=493.02, 90=651, 99=1051, 99.9=3585, 99.99=5075] 
[OVERALL], RunTime(ms), 4519
[OVERALL], Throughput(ops/sec), 22128.78955521133
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 28
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6196061075459172
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 28
[TOTAL_GC_TIME_%], Time(%), 0.6196061075459172
[READ], Operations, 94974
[READ], AverageLatency(us), 489.91163897487735
[READ], MinLatency(us), 88
[READ], MaxLatency(us), 20511
[READ], 95thPercentileLatency(us), 723
[READ], 99thPercentileLatency(us), 1031
[READ], Return=OK, 94974
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 139.4
[CLEANUP], MinLatency(us), 50
[CLEANUP], MaxLatency(us), 760
[CLEANUP], 95thPercentileLatency(us), 760
[CLEANUP], 99thPercentileLatency(us), 760
[UPDATE], Operations, 5026
[UPDATE], AverageLatency(us), 493.0159172304019
[UPDATE], MinLatency(us), 153
[UPDATE], MaxLatency(us), 7107
[UPDATE], 95thPercentileLatency(us), 736
[UPDATE], 99thPercentileLatency(us), 1051
[UPDATE], Return=OK, 5026