results/redis/run_workload_b.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P workloads/workloadb -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p operationcount=100000 -p threadcount=10
Command line: -t -db site.ycsb.db.RedisClient -s -P workloads/workloadb -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p operationcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2025-12-31 13:48:00:562 0 sec: 0 operations; est completion in 0 second 
2025-12-31 13:48:03:907 3 sec: 100000 operations; 29550.83 current ops/sec; [READ: Count=94984, Max=17087, Min=82, Avg=328.7, 90=428, 99=626, 99.9=2759, 99.99=13031] [CLEANUP: Count=10, Max=548, Min=38, Avg=98.9, 90=63, 99=548, 99.9=548, 99.99=548] [UPDATE: Count=5016, Max=3127, Min=91, Avg=328.28, 90=433, 99=638, 99.9=2533, 99.99=2977] 
[OVERALL], RunTime(ms), 3384
[OVERALL], Throughput(ops/sec), 29550.827423167848
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 21
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6205673758865249
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 21
[TOTAL_GC_TIME_%], Time(%), 0.6205673758865249
[READ], Operations, 94984
[READ], AverageLatency(us), 328.69850711698814
[READ], MinLatency(us), 82
[READ], MaxLatency(us), 17087
[READ], 95thPercentileLatency(us), 483
[READ], 99thPercentileLatency(us), 626
[READ], Return=OK, 94984
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 98.9
[CLEANUP], MinLatency(us), 38
[CLEANUP], MaxLatency(us), 548
[CLEANUP], 95thPercentileLatency(us), 548
[CLEANUP], 99thPercentileLatency(us), 548
[UPDATE], Operations, 5016
[UPDATE], AverageLatency(us), 328.28409090909093
[UPDATE], MinLatency(us), 91
[UPDATE], MaxLatency(us), 3127
[UPDATE], 95thPercentileLatency(us), 495
[UPDATE], 99thPercentileLatency(us), 638
[UPDATE], Return=OK, 5016